#ifndef __CHESS_H__
#define __CHESS_H__ 

int black_chess[14][2] = {
        {10, 3},  // K10，数据序号 0
        {10, 9},  // K4，数据序号 1
        {5, 10},  // F3，数据序号 2
        {6, 2},   // G11，数据序号 3
        {2, 4},   // C9，数据序号 4
        {2, 5},   // C8，数据序号 5
        {3, 5},   // D8，数据序号 6
        {1, 3},   // B10，数据序号 7
        {7, 3},   // H10，数据序号 8
        {1, 2},   // B11，数据序号 9
        {5, 3},   // F10，数据序号 10
        {5, 4},   // F9，数据序号 11
        {6, 5}    // G8，数据序号 12
    };

int write_chess[14][2] = {
        {3, 9},   // 对应 D4，数据序号 0
        {2, 3},   // 对应 C10，数据序号 1
        {4, 3},   // 对应 E10，数据序号 2
        {7, 10},  // 对应 H3，数据序号 3
        {3, 4},   // 对应 D9，数据序号 4
        {2, 7},   // 对应 C6，数据序号 5
        {6, 3},   // 对应 G10，数据序号 6
        {2, 2},   // 对应 C11，数据序号 7
        {6, 4},   // 对应 G9，数据序号 8
        {5, 2},   // 对应 F11，数据序号 9
        {11, 10}, // 对应 L3，数据序号 10
        {5, 5},   // 对应 F8，数据序号 11
        {4, 4}    // 对应 E9，数据序号 12
    };

#endif